<center>
<img src="../../img/ods_stickers.jpg">
## Открытый курс по машинному обучению
Автор материала: программист-исследователь Mail.ru Group, старший преподаватель Факультета Компьютерных Наук ВШЭ Юрий Кашницкий. Материал распространяется на условиях лицензии [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/). Можно использовать в любых целях (редактировать, поправлять и брать за основу), кроме коммерческих, но с обязательным упоминанием автора материала.

# <center>Домашнее задание 1. <br> Анализ данных по доходу населения UCI Adult</center>

**В задании предлагается с помощью Pandas ответить на несколько вопросов по данным репозитория UCI [Adult](https://archive.ics.uci.edu/ml/datasets/Adult) (качать данные не надо – они уже есть в репозитории). Для отправки решений используйте [онлайн-форму](https://goo.gl/forms/pB1tDIArMvTUsIUg2).**

Уникальные значения признаков (больше информации по ссылке выше):
- age: continuous.
- workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- fnlwgt: continuous.
- education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- education-num: continuous.
- marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- sex: Female, Male.
- capital-gain: continuous.
- capital-loss: continuous.
- hours-per-week: continuous.
- native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.   
- salary: >50K,<=50K

In [52]:
import pandas as pd
import numpy as np
%matplotlib inline 
import matplotlib.pyplot as plt
import seaborn as sns
plt.rcParams['figure.figsize'] = (10, 8)

In [49]:
data = pd.read_csv(r'C:\projects\Python\mlcourse_open\Lesson1\adult.data.csv')
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [38]:
dic = {'Male' : False, 'Female': True}
data['sex'] = data['sex'].map(dic)
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,NaN,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,NaN,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,NaN,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,NaN,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,NaN,0,0,40,Cuba,<=50K

**1. Сколько мужчин и женщин (признак *sex*) представлено в этом наборе данных?**

In [10]:
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

**2. Каков средний возраст (признак *age*) женщин?**

In [16]:
data[(data['sex'] == 'Female')].mean()

age                   36.858230
fnlwgt            185746.311206
education-num         10.035744
capital-gain         568.410547
capital-loss          61.187633
hours-per-week        36.410361
dtype: float64

**3. Какова доля граждан Германии (признак *native-country*)?**

In [91]:
data['native-country'].value_counts(normalize = True)

United-States                 0.895857
Mexico                        0.019748
?                             0.017905
Philippines                   0.006081
Germany                       0.004207
Canada                        0.003716
Puerto-Rico                   0.003501
El-Salvador                   0.003255
India                         0.003071
Cuba                          0.002918
England                       0.002764
Jamaica                       0.002488
South                         0.002457
China                         0.002303
Italy                         0.002242
Dominican-Republic            0.002150
Vietnam                       0.002058
Guatemala                     0.001966
Japan                         0.001904
Poland                        0.001843
Columbia                      0.001812
Taiwan                        0.001566
Haiti                         0.001351
Iran                          0.001321
Portugal                      0.001136
Nicaragua                     0.001044
Peru                          0.000952
France                        0.000891
Greece                        0.000891
Ecuador                       0.000860
Ireland                       0.000737
Hong                          0.000614
Cambodia                      0.000584
Trinadad&Tobago               0.000584
Thailand                      0.000553
Laos                          0.000553
Yugoslavia                    0.000491
Outlying-US(Guam-USVI-etc)    0.000430
Hungary                       0.000399
Honduras                      0.000399
Scotland                      0.000369
Holand-Netherlands            0.000031
Name: native-country, dtype: float64

**4. Постройте гистограмму распределения (*bar plot*) образования людей (признак *education*).**

In [ ]:
# Ваш код здесь

**5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год? **

In [56]:
data[(data['salary'] == '>50K')].agg([np.mean, np.std])

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
mean,44.249841,188005.000000,11.611657,4006.142456,195.001530,45.473026
std,10.519028,102541.775472,2.385129,14570.378951,595.487574,11.012971

In [61]:
data[(data['salary'] == '<=50K')].agg([np.mean, np.std])

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
mean,36.783738,190340.865170,9.595065,148.752468,53.142921,38.840210
std,14.020088,106482.271195,2.436147,963.139307,310.755769,12.318995

**6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак *education - Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [62]:
table_cross = pd.crosstab(data['education'], data['salary'] == '>50K')
table_cross

salary        False  True
education
10th            871     62
11th           1115     60
12th            400     33
1st-4th         162      6
5th-6th         317     16
7th-8th         606     40
9th             487     27
Assoc-acdm      802    265
Assoc-voc      1021    361
Bachelors      3134   2221
Doctorate       107    306
HS-grad        8826   1675
Masters         764    959
Preschool        51      0
Prof-school     153    423
Some-college   5904   1387

In [87]:
tb_group_salary_japan_mean = data.groupby(['native-country', 'salary'])['hours-per-week'].mean()
tb_group_salary_japan_mean['Japan']

salary
<=50K    41.000000
>50K     47.958333
Name: hours-per-week, dtype: float64

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Amer-Indian-Eskimo*.**

In [95]:
data_age = data.groupby(['race', 'sex'])['age'].describe()
data_age

                             count       mean        std   min   25%   50%  \
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [97]:
tb_group_femail_merry_salary = data.groupby(['salary', 'sex'])['marital-status'].value_counts()
tb_group_femail_merry_salary

salary  sex     marital-status
<=50K   Female  Never-married            4601
                Divorced                 2493
                Married-civ-spouse        903
                Widowed                   779
                Separated                 614
                Married-spouse-absent     194
                Married-AF-spouse           8
        Male    Married-civ-spouse       7381
                Never-married            5591
                Divorced                 1487
                Separated                 345
                Married-spouse-absent     190
                Widowed                   129
                Married-AF-spouse           5
>50K    Female  Married-civ-spouse        754
                Divorced                  179
                Never-married             166
                Widowed                    46
                Separated                  17
                Married-spouse-absent      11
                Married-AF-spouse           6
        Male    Married-civ-spouse       5938
                Never-married             325
                Divorced                  284
                Separated                  49
                Widowed                    39
                Married-spouse-absent      23
                Married-AF-spouse           4
Name: marital-status, dtype: int64

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [106]:
tb_group_solary_hoursweek = data.groupby(['hours-per-week'])['salary'].value_counts(normalize=True)
tb_group_solary_hoursweek

hours-per-week  salary
1               <=50K     0.900000
                >50K      0.100000
2               <=50K     0.750000
                >50K      0.250000
3               <=50K     0.974359
                >50K      0.025641
4               <=50K     0.944444
                >50K      0.055556
5               <=50K     0.883333
                >50K      0.116667
6               <=50K     0.875000
                >50K      0.125000
7               <=50K     0.846154
                >50K      0.153846
8               <=50K     0.924138
                >50K      0.075862
9               <=50K     0.944444
                >50K      0.055556
10              <=50K     0.928058
                >50K      0.071942
11              <=50K     1.000000
12              <=50K     0.930636
                >50K      0.069364
13              <=50K     0.913043
                >50K      0.086957
14              <=50K     0.941176
                >50K      0.058824
15              <=50K     0.962871
                >50K      0.037129
16              <=50K     0.936585
                            ...
78              <=50K     0.750000
                >50K      0.250000
80              <=50K     0.571429
                >50K      0.428571
81              <=50K     1.000000
82              <=50K     1.000000
84              <=50K     0.622222
                >50K      0.377778
85              <=50K     0.692308
                >50K      0.307692
86              <=50K     1.000000
87              <=50K     1.000000
88              <=50K     1.000000
89              <=50K     0.500000
                >50K      0.500000
90              <=50K     0.655172
                >50K      0.344828
91              <=50K     1.000000
92              <=50K     1.000000
94              <=50K     1.000000
95              <=50K     0.500000
                >50K      0.500000
96              <=50K     0.800000
                >50K      0.200000
97              <=50K     0.500000
                >50K      0.500000
98              <=50K     0.727273
                >50K      0.272727
99              <=50K     0.705882
                >50K      0.294118
Name: salary, Length: 173, dtype: float64

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [107]:
tb_group_salary_japan_mean = data.groupby(['native-country', 'salary'])['hours-per-week'].mean()
tb_group_salary_japan_mean['Japan']

salary
<=50K    41.000000
>50K     47.958333
Name: hours-per-week, dtype: float64